package com.nollpointer.dates_zno.other;

import android.content.Context;
import android.view.LayoutInflater;
import android.view.View;
import android.widget.TextView;

import androidx.appcompat.app.AlertDialog;

import com.nollpointer.dates_zno.R;


public class ResultDialog {

    public static interface ResultDialogCallbackListener {
        void reset();

        void exit();
    }

    ResultDialogCallbackListener listener;

    int rightAnswers;
    String mark;
    int markColor;

    public ResultDialog(int rightAnswers, String mark, int markColor, ResultDialogCallbackListener listener) {
        this.rightAnswers = rightAnswers;
        this.mark = mark;
        this.markColor = markColor;
        this.listener = listener;
    }

    public void showDialog(Context context) {
        LayoutInflater factory = LayoutInflater.from(context);
        View dialogView = factory.inflate(R.layout.dialog_result_layout, null);
        final AlertDialog dialog = new AlertDialog.Builder(context).create();
        dialog.setCancelable(false);
        dialog.setView(dialogView);


        dialogView.findViewById(R.id.result_exit).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                dialog.dismiss();
                listener.exit();
            }
        });

        dialogView.findViewById(R.id.result_reset).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                dialog.dismiss();
                listener.reset();
            }
        });

        TextView textView = dialogView.findViewById(R.id.result_mark);
        textView.setText(mark);
        textView.setTextColor(markColor);
        int imageId = getImageId();
        textView.setCompoundDrawablesRelativeWithIntrinsicBounds(imageId, 0, 0, 0);

        textView = dialogView.findViewById(R.id.result_right_answers);
        StringBuffer answers = new StringBuffer(Integer.toString(rightAnswers));

        if (rightAnswers == 0)
            answers.append(" правильных ответов");
        else if (rightAnswers == 1)
            answers.append(" правильный ответ");
        else if (rightAnswers < 5)
            answers.append(" правильный ответа");
        else
            answers.append(" правильных ответов");
        textView.setText(answers);
        textView.setCompoundDrawablesRelativeWithIntrinsicBounds(R.drawable.ic_check_box, 0, 0, 0);


        dialog.show();
    }

    private int getImageId() {
        int imageId;
        if (rightAnswers < 5)
            imageId = R.drawable.ic_sentiment_very_bad;
        else if (rightAnswers < 9)
            imageId = R.drawable.ic_sentiment_bad;
        else if (rightAnswers < 13)
            imageId = R.drawable.ic_sentiment_neutral;
        else if (rightAnswers < 17)
            imageId = R.drawable.ic_sentiment_good;
        else
            imageId = R.drawable.ic_sentiment_very_good;
        return imageId;
    }


    public static final String datesFullNewMode = "IV- сер. III тис. до н.е.#розселення племен трипільської культури (орнаментована кераміка)#Чингисхан#1\n" +
            "VIII-VI ст. до н.е.#Велика грецька колонізація#Чингисхан#1\n" +
            "друга пол. V-VII ст.#Велике розселення слов'ян#Чингисхан#1\n" +
            "860#Похід Аскольда на Константинополь, перший відомий договір Русі з Візантією#Чингисхан#1\n" +
            "882#Об'єднання північних і південних руських земель Олегом.#Чингисхан#1\n" +
            "907, 911, 941, 944#Походи князів на Константинополь (Олег та Ігор)#Чингисхан#1\n" +
            "988#Запровадження християнства як державної релігії (Володимир)#Чингисхан#1\n" +
            "1019-1054#Князювання Ярослава Мудрого в Києві (Руська правда, печеніги, Соф. Собор, Іларіон)#Чингисхан#1\n" +
            "1036#Розгром печенігів князем Ярославом Мудрим (тут побудовано Софійський Собор)#Чингисхан#1\n" +
            "1056-1057#Створення Остромирового Євангелія#Чингисхан#1\n" +
            "1097#Любецький з'їзд (снем) князів («Кожен хай держить вотчину свою»)#Чингисхан#1\n" +
            "1113#Початок правління Володимира Мономаха в Києві. Укладення «Повісті минулих літ».#Чингисхан#1\n" +
            "1187#Перша згадка назви «Україна» в писемних джерелах. Створення «Слова о полку Ігоревім» (про похід на половців)#Чингисхан#1\n" +
            "1199#Утворення Галицько-Волинської держави (Роман Мстиславович)#Чингисхан#1\n" +
            "1223#Битва на р. Калка (трагічна поразка руських князів від монголо-татар)#Чингисхан#1\n" +
            "1238-1264#Правління Данили Романовича Галицького (король, Львів, антимонгольська коаліція)#Чингисхан#1\n" +
            "1240#Захоплення Києва монголами (Батиєм, Ордою)#Чингисхан#1\n" +
            "1362#Битва на р. Сині Води (литовець Ольгерд розбив Орду та приєднав до ВКЛ укр. землі)#Чингисхан#1\n" +
            "1385#Кревська унія (Ягайло і Ядвига – Литва та Польща)#Чингисхан#1\n" +
            "40-і рр. XV ст.#Утворення Кримського ханства (Хаджі І Гірей)#Чингисхан#1\n" +
            "1478#Визнання Кримським ханством васальної залежності від Османської імперії#Чингисхан#1\n" +
            "1489#Перша згадка про українських козаків у писемних джерелах#Чингисхан#1\n" +
            "1514#Битва під Оршею (православний князь К. Острозький (ВКЛ) розбив москов. війська)#Чингисхан#1\n" +
            "1556-1561#Створення Пересопницького Євангелія#Чингисхан#1\n" +
            "1556#Заснування князем Д. Вишневецьким першої Запорозької Січі на о. Мала Хортиця#Чингисхан#1\n" +
            "1569#Люблінська унія – Утворення Речі Посполитої#Чингисхан#1\n" +
            "1596#Берестейська церковна унія. Утворення Греко-католицької церкви#Чингисхан#1\n" +
            "1618#Похід козаків під проводом гетьмана П. Конашевича-Сагайдачного на Москву#Чингисхан#1\n" +
            "1620#Відновлення православної церковної ієрархії (І. Борецький)#Чингисхан#1\n" +
            "1621#Хотинська битва (поляки з козаками перемагають турків, поранення П. Сагайдачного)#Чингисхан#1\n" +
            "1625#Куруківська угода (повстання М. Жмайла; реєстр – 6 тис., поділ його земель на полки)#Чингисхан#1\n" +
            "1632#«Пункти для заспокоєння руського народу». Утворення Києво-Могилянської колегії.#Чингисхан#1\n" +
            "1637-38#Повстання під проводом П. Павлюка (Бута), Я. Острянина та Д. Гуні. Поляки видають «Ординацію Війська Запорозького» (1638).#Чингисхан#1\n" +
            "1648-1657#Національна-визвольна війна під проводом Б. Хмельницького#Чингисхан#1\n" +
            "1648#Жовтоводська, Корсунська та Пилявецька битва#Чингисхан#1\n" +
            "1649#Зборівська битва та Зборівський договір («добрий» - 40 тис, 3 воєводства)#Чингисхан#1\n" +
            "1651#Берестецька битва. Укладення Білоцерковського договору («поганий» - 20 тис, 1 воєв.)#Чингисхан#1\n" +
            "1652#Батозька битва (продовження походу козаків Т. Хмельниц. на Молдавію)#Чингисхан#1\n" +
            "1653#Жванецька облога (король Ян Казимир ледь врятувався, повернення до Збор. договору)#Чингисхан#1\n" +
            "1654#Українсько-московський договір: Переяславська рада, «Березневі статті»#Чингисхан#1\n" +
            "1656#Московсько-польське Віленське перемир’я (як наслідок – союз БХ зі Швец. і Транс.)#Чингисхан#1\n" +
            "1658#Гадяцький договір (Виговський з Польщею про Велике князівство Руське)#Чингисхан#1\n" +
            "1659#Конотопська битва (козаки з татарами розбили московську кінноту)#Чингисхан#1\n" +
            "1667#Андрусівський договір (поділ України між Польщею і Москвою)#Чингисхан#1\n" +
            "1669#Корсунська угода, визнання Правобережною Гетьманщиною протекторату Османської імперії (П. Дорошенко)#Чингисхан#1\n" +
            "1681#Бахчисарайський мир (між Росією, Кримським ханством і Османською імперією)#Чингисхан#1\n" +
            "1686#«Вічний мир» (фіксування поділу України по Дніпру між Польщею і Моск. Царством)#Чингисхан#1\n" +
            "1708#Українсько-шведський союз (Мазепа). Зруйнування Батурина російськ. військами.#Чингисхан#1\n" +
            "1709#Зруйнування російськими військами Чортомлицької Січі. Полтавська битва (Петро І)#Чингисхан#1\n" +
            "1710#Конституція Пилипа Орлика (м. Бендери)#Чингисхан#1\n" +
            "1713#Ліквідація козацтва на Правобережній Україні (польська частина України)#Чингисхан#1\n" +
            "1734#Заснування Нової (Підпільненської) Січі (домігся Д. Апостол, який того ж року помер)#Чингисхан#1\n" +
            "1764#Остаточна ліквідація гетьманства в Україні (Катерина ІІ зняла К. Розумовського)#Чингисхан#1\n" +
            "1768#Коліївщина (гайдамаки на Правобережжі проти поляків)#Чингисхан#1\n" +
            "1775#Остаточна ліквідація Запорозької Січі царським урядом (Катерина ІІ)#Чингисхан#1\n" +
            "1780-1782#Ліквідація особистої залежності селян в Австрійській імперії (Марія Терезія)#Чингисхан#1\n" +
            "1783#Закріпачення селян Лівобережної і Слобідської України (Катерина ІІ)#Чингисхан#1\n" +
            "1798#Видання «Енеїди» І. Котляревського#Чингисхан#1\n" +
            "1805#Відкриття університету в Харкові#Чингисхан#1\n" +
            "1816#Створення освітнього товариства греко-католицьких священиків (Перемишль, Австрія)#Чингисхан#1\n" +
            "груд 1825-січ 1826#Повстання Чернігівського полку (декабристи)#Чингисхан#1\n" +
            "1828#Ліквідація Задунайської Січі (отаман Й. Гладкий)#Чингисхан#1\n" +
            "1830-1831#Польське визвольне повстання (проти Росії)#Чингисхан#1\n" +
            "1833-1837#Діяльність Руської трійці (Львів, «Русалка Дністрова»)#Чингисхан#1\n" +
            "1834#Відкриття університету в Києві#Чингисхан#1\n" +
            "1839#Ліквідація греко-католицької церкви в підросійській Україні#Чингисхан#1\n" +
            "1840#Видання «Кобзаря» Т. Шевченка#Чингисхан#1\n" +
            "1846-1847#Діяльність Кирило-Мефодіївського братства (Костомаров, Куліш, за федерацію слов’ян)#Чингисхан#1\n" +
            "1848#Скасування панщини в Галичині; перша українськомовна газета «Зоря Галицька» («Весна народів» - революція в Австрії; Головна Руська Рада, Собор рус. учених у Львові і т.д.)#Чингисхан#1\n" +
            "19.02.1861#Царський маніфест про скасування кріпосного права в Російській імперії (Олександр ІІ)#Чингисхан#1\n" +
            "1863#Валуєвський циркуляр#Чингисхан#1\n" +
            "1863-1864#Польське національно-визвольне повстання#Чингисхан#1\n" +
            "1865#Відкриття Новоросійського університету (Одеса)#Чингисхан#1\n" +
            "1868#Створення у Львові товариства «Просвіта»#Чингисхан#1\n" +
            "1873#Створення у Львові Літературного товариства ім. Т. Шевченка (із 1892 – Наукове Товариство ім. Т. Шевченка)#Чингисхан#1\n" +
            "1875#Відкриття Чернівецького університету#Чингисхан#1\n" +
            "1876#Емський указ#Чингисхан#1\n" +
            "1890#Створення Русько-української радикальної партії  (І. Франко)#Чингисхан#1\n" +
            "1899#Створення Української націонал-демократичної партії (Франко, Грушевський), Української соціал-демократичної партії#Чингисхан#1\n" +
            "1900#Утворення Революційної української партії (РУП) – першої в Наддніпрянській Україні#Чингисхан#1\n" +
            "1900#Обрання А. Шептицького митрополитом греко-католицької церкви#Чингисхан#1\n" +
            "1905-07#Революція в Росії. Жовтень 05 – маніфест Миколи ІІ. (1906 Початок реформ Столипіна)#Чингисхан#1\n" +
            "1907#Впровадження в Австро-Угорській імперії загального виборчого права для чоловіків#Чингисхан#1\n" +
            "1908#Створення Товариства українських поступовців (Київ, Грушевський, Чикаленко, Єфремов)#Чингисхан#1\n" +
            "1911-1913#«Справа Бейліса» (антисемітизм в Росії)#Чингисхан#1\n" +
            "Серпень 1914#Початок Першої світової війни: формування легіону Українських січових стрільців, утворення Головної Української Ради і Союзу Визволення України (Львів).#Чингисхан#1\n" +
            "1915#Утворення Загальної Української Ради (Львів, ГУР+СВУ)#Чингисхан#1\n" +
            "1916#Брусиловський прорив (наступ російської армії на захід – до Львова не дійшли)#Чингисхан#1\n" +
            "Лютий-березень 1917#Лютнева революція в Росії. Повалення царського режиму#Чингисхан#1\n" +
            "Березень 1917#Утворення Української Центральної Ради#Чингисхан#1\n" +
            "Квітень 1917#Всеукраїнський національний конгрес у Києві#Чингисхан#1\n" +
            "Червень 1917#І Універсал Центральної Ради (проголошення автономії України)#Чингисхан#1\n" +
            "Липень 1917#ІІ Універсал Центральної Ради (відкладення автономії)#Чингисхан#1\n" +
            "Листопад 1917#«Жовтневий» переворот в Петрограді – більшовики (Ленін) повалили Тимчасовий уряд#Чингисхан#1\n" +
            "Листопад 1917#ІІІ Універсал Центральної Ради (проголошення автономії Укр. Нар. Респ. – УНР)#Чингисхан#1\n" +
            "9(22) січня 1918# IV Універсал Центральної Ради (проголошення незалежності УНР)#Чингисхан#1\n" +
            "Січень 1918#Бій під Крутами (загибель українських юнаків в бою проти Червоної армії)#Чингисхан#1\n" +
            "Січень (лютий) 1918#Брестський мир між УНР і державами Четверного союзу#Чингисхан#1\n" +
            "29 квітня 1918#Державний переворот і прихід до влади гетьмана П. Скоропадського#Чингисхан#1\n" +
            "Листопад 1918#Заснування Української академії Наук (Київ)#Чингисхан#1\n" +
            "1 листопада 1918#«Листопадовий зрив у Львові» (захоплення влади у місті українцями)#Чингисхан#1\n" +
            "13 листопада 1918#Проголошення Західноукраїнської народної республіки (ЗУНР, Петрушевич)#Чингисхан#1\n" +
            "14 листопада 1918#Утворення Директорії УНР (Винниченко, Петлюра та ін.)#Чингисхан#1\n" +
            "22 січня 1919#Акт злуки УНР і ЗУНР#Чингисхан#1\n" +
            "грудень 1918 - 1921#Друга українсько-радянська війна (за участі білих, отаманів, Антанти, поляків)#Чингисхан#1\n" +
            "30 серпня 1919#«Київська катастрофа» (червоні відступають, але Укр. Галиц. Армія здає місто білим)#Чингисхан#1\n" +
            "Груд. 1919 – трав 1920#Перший «Зимовий похід» Армії УНР#Чингисхан#1\n" +
            "Квітень 1920#Варшавська угода (УНР і Польща; потім – радянсько-польська війна)#Чингисхан#1\n" +
            "Листопад 1920#Розгром білих Врангеля в Криму (червоні та махновці)#Чингисхан#1\n" +
            " 1920 # Підписання Бессарабського протоколу: визнання країнами Антанти входження Бессарабії до складу Румунії.#Чингисхан#1\n" +
            " 1921 # березень # Ризький мирний договір (Польща, УСРР, РСФРР: Визнання Зах. України за Польщею)#Чингисхан#1\n" +
            " 1921 # листопад # Другий «Зимовий похід» Армії УНР#Чингисхан#1\n" +
            " 1921-1923 # Голод в Україні#Чингисхан#1\n" +
            " 1921 # Перехід до нової економічної політики (непу; від продрозкладки до продподатку та ін.)#Чингисхан#1\n" +
            " 1921 # Утворення Української Автокефальної православної церкви (УАПЦ)#Чингисхан#1\n" +
            " 1922 # Входження УСРР до складу СРСР#Чингисхан#1\n" +
            " 1923 # Початок політики «коренізації» в УСРР (в тому числі, «українізації»)#Чингисхан#1\n" +
            " 1923 # Визнання країнами Антанти входження Східної Галичини до складу Польщі; саморозпуск уряду ЗУНР#Чингисхан#1\n" +
            " 1925 # Проголошення курсу на індустріалізацію#Чингисхан#1\n" +
            " 1925 # Утворення Українського національно-демократичного об’єднання (УНДО, Львів)#Чингисхан#1\n" +
            " 1928/1929 - 1932 #Перша п’ятирічка#Чингисхан#1\n" +
            " 1928 # Судовий процес у «Шахтинській справі» (проти т.зв. «шкідників»)#Чингисхан#1\n" +
            " 1929 # «Рік великого перелому» (рішення про форсовану індустріалізацію, суцільну колективізацію)#Чингисхан#1\n" +
            " 1929 # Початок насильницької колективізації в СРСР#Чингисхан#1\n" +
            " 1929 # Утворення Організації українських націоналістів (ОУН, Відень, Є. Коновалець)#Чингисхан#1\n" +
            " 1930 # Проведення польською владою акції «пацифікації»#Чингисхан#1\n" +
            " 1930 # Судовий процес у справі «Спілки визволення України» (СВУ, засуд. С. Єфремова та ін.)#Чингисхан#1\n" +
            " 1932-1933 #Голодомор в Україні#Чингисхан#1\n" +
            " 1934 #Перенесення столиці УСРР з Харкова до Києва#Чингисхан#1\n" +
            " 1937 # Ухвалення Конституції УРСР#Чингисхан#1\n" +
            " 1938 # Надання автономії Підкарпатській Русі (Закарпаттю) у складі Чехо-Словаччини#Чингисхан#1\n" +
            " 1937-1938 # «Великий терор» в СРСР (сталінські репресії)#Чингисхан#1\n" +
            " 1939 # 15 березня #Проголошення незалежності Карпатської України (А. Волошин)#Чингисхан#1\n" +
            " 1939 # 23 серпня #Радянсько-німецький договір про ненапад і таємний протокол до нього («пакт Молотова-Ріббентропа»)#Чингисхан#1\n" +
            " 1939 # 1 вересня #Початок Другої світової війни#Чингисхан#1\n" +
            " 1939 # 17 вересня #Вторгнення Червоної армії на територію Західної України#Чингисхан#1\n" +
            " 1940 # червень # Вторгнення Червоної армії на територію Бессарабії та Північної Буковини#Чингисхан#1\n" +
            " 1941 # 22 червня #Напад Німеччини на СРСР#Чингисхан#1\n" +
            " 1941 # 30 червня # Проголошення Акта відновлення незалежності Української Держави (Львів)#Чингисхан#1\n" +
            " 1942 # 14 жовтня # Створення Української повстанської армії (УПА)#Чингисхан#1\n" +
            " 1942 # грудень #Початок вигнання нацистських загарбників з України#Чингисхан#1\n" +
            " 1943 # 6 листопада # Визволення Києва від нацистських окупантів#Чингисхан#1\n" +
            " 1944 # січень-лютий # Корсунь-Шевченківська наступальна операція Радянської Армії#Чингисхан#1\n" +
            " 1944 # 28 жовтня # Завершення вигнання нацистських окупантів з території України (Карп-Ужгород. оп.)#Чингисхан#1\n" +
            " 1945 # 9 травня # День Перемоги над нацистською Німеччиною#Чингисхан#1\n" +
            " 1945 # 2 вересня # Завершення Другої світової війни (в Японії)#Чингисхан#1\n" +
            " 1945 # Входження Закарпаття до складу УРСР#Чингисхан#1\n" +
            " 1945 # квітень # Україна стає співзасновницею ООН#Чингисхан#1\n" +
            " 1946 # березень # «Саморозпуск» Української греко-католицької церкви (УГКЦ)#Чингисхан#1\n" +
            " 1946-1947 # Голод в Україні#Чингисхан#1\n" +
            " 1947 # квітень - липень # Проведення польською владою операції «Вісла» (депортація українців на захід Польщі)#Чингисхан#1\n" +
            " 1953-1954 # Повстання політичних в’язнів в сталінських концтаборах. Ліквідація ГУЛАГу.#Чингисхан#1\n" +
            " 1954 # лютий #Входження Кримської області до складу УРСР#Чингисхан#1\n" +
            " 1956 #ХХ з’їзд КПРС – засудження культу особи.#Чингисхан#1\n" +
            " 1957 #Запуск першого штучного супутника Землі, початок «космічної ери»#Чингисхан#1\n" +
            " 1959 #Утворення Української робітничо-селянської спілки (дисидент Л. Лук’яненко, Львів)#Чингисхан#1\n" +
            " 1961 #Перший політ людини в Космос (Ю. Гагарін)#Чингисхан#1\n" +
            " 1965 #Реформи в сільському господарстві та промисловості («косигінська реформа»). Перша хвиля арештів дисидентів. Виступ дисидентів в кінотеатрі «Україна».#Чингисхан#1\n" +
            " 1972 #Зміна політичного керівництва УРСР (Шелеста на Щербицького), масові арешти дисидентів#Чингисхан#1\n" +
            " 1976 #Утворення Української Гельсінської групи (Руденко, Григоренко, Лук’яненко та ін.)#Чингисхан#1\n" +
            " 1985 # квітень #Початок «перебудови»#Чингисхан#1\n" +
            " 1986 # 26 квітня #Аварія на Чорнобильській АЕС#Чингисхан#1\n" +
            " 1989 # вересень #Створення Народного руху України за перебудову#Чингисхан#1\n" +
            " 1990 # березень #Проведення перших альтернативних виборів до Верховної Ради УРСР#Чингисхан#1\n" +
            " 1990 # 16 липня # Ухвалення Верховною Радою УРСР Декларації про державний суверенітет України#Чингисхан#1\n" +
            " 1990 # жовтень #  «Революція на граніті» (голодування студентів в Києві з політичними вимогами)#Чингисхан#1\n" +
            " 1991 # 24 серпня # Ухвалення Верховною Радою УРСР Акта проголошення незалежності України#Чингисхан#1\n" +
            " 1991 # 1 грудня # Проведення Всеукраїнського референдуму та виборів Президента України. Обрання Л. Кравчука.#Чингисхан#1\n" +
            " 1991 # 6 грудня # Заснування Збройних сил України#Чингисхан#1\n" +
            " 1994 # липень # Обрання Л. Кучми Президентом України#Чингисхан#1\n" +
            " 1995 # Обрання України членом Ради Європи (РЄ)#Чингисхан#1\n" +
            " 1996 # 28 червня # Ухвалення Конституції України#Чингисхан#1\n" +
            " 1996 # вересень # Запровадження національної грошової одиниці – гривні#Чингисхан#1\n" +
            " 2004 # жовтень-грудень # «Помаранчева революція». Президентом України обрано В. Ющенка#Чингисхан#1\n" +
            " 2008 # Вступ України до Світової організації торгівлі (СОТ)#Чингисхан#1\n" +
            " 2010 # Обрання Президентом України В. Януковича#Чингисхан#1\n" +
            " 2013–2014 # листопад – лютий # «Революція Гідності», повалення режиму В. Януковича#Чингисхан#1\n" +
            " 2014 # червень # Обрання Президентом П. Порошенка#Чингисхан#1\n" +
            " 2014 # Підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС)#Чингисхан#1\n" +
            " 2014, 2015 # вересень, лютий #Мінські угоди (про врегулюванню конфлікту на Донбасі)#Чингисхан#1\n";



}
