package com.nollpointer.dates_zno;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;
import android.util.Log;

import java.util.Scanner;


public class DatesDatabaseHelper extends SQLiteOpenHelper {
    private static final String DB_NAME="dates";
    private static final int DB_VERSION = 3;
    public DatesDatabaseHelper(Context context) {
        super(context,DB_NAME,null,DB_VERSION);
    }

    @Override
    public void onDowngrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        db.execSQL("DROP TABLE D10");
        db.execSQL("DROP TABLE D1");
        onCreate(db);
    }

    @Override
    public void onUpgrade(SQLiteDatabase sqLiteDatabase, int i, int i1) {
        sqLiteDatabase.execSQL("DROP TABLE D10");
        sqLiteDatabase.execSQL("DROP TABLE D1");
        onCreate(sqLiteDatabase);
    }
    private void insertDate(SQLiteDatabase db,String name, String date,String event){
        ContentValues ct = new ContentValues();
        ct.put("DATE",date);
        ct.put("EVENT",event);
        db.insert(name,null,ct);
    }
    private void parseString(SQLiteDatabase db,String table_name,String text){
        Scanner scan = new Scanner(text);
        String[] str;
        while (scan.hasNextLine()) {
            str = scan.nextLine().split("#");
            Log.w("sad",str[0]);
            insertDate(db, table_name, str[0].trim(),Character.toUpperCase(str[1].trim().charAt(0)) +  str[1].trim().substring(1));
        }
    }


    @Override
    public void onCreate(SQLiteDatabase db) {
        db.execSQL("CREATE TABLE D10 (_id INTEGER PRIMARY KEY AUTOINCREMENT,DATE TEXT, EVENT DATE);");
        db.execSQL("CREATE TABLE D1 (_id INTEGER PRIMARY KEY AUTOINCREMENT,DATE TEXT, EVENT DATE);");
        parseString(db,"D1", "IV - середина III тис. до н.е.#розселення племен трипільської культури на території України\n" +
                "V - VІІ ст.#Велике розселення слов'ян.\n" +
                "882 р.#об'єднання північних та південних руських земель Олегом\n" +
                "988 р.#запровадження християнства як державної релігії\n" +
                "1019-1054 рр.#князювання Ярослава Мудрого в Києві\n" +
                "1097 р.#Любецький з'їзд князів\n" +
                "1199 р.#утворення Галицько-Волинської держави\n" +
                "1238-1264 рр.#правління Данила Романовича\n" +
                "1240 р.#захоплення Києва монголами\n" +
                "1056-1057 рр.#створення Остромирового Євангелія\n" +
                "1113 р.#укладення «Повісті минулих літ» ченцем Нестором літописцем\n" +
                "1187 р.#створення «Слова о полку Ігоревім»\n" +
                "1187 р.#перша згадка назви «Україна» в писемних джерелах\n" +
                "1362 р.#битва на р. Сині Води\n" +
                "1385 р.#укладення Кревської унії\n" +
                "1449 р.#утворення Кримського ханства\n" +
                "1471 р.#остаточна ліквідація Київського удільного князівства\n" +
                "1489 р.#перша згадка про українських козаків у писемних джерелах\n" +
                "1556-1561 р.#створення Пересопницького Євангелія\n" +
                "1556 р.#заснування князем Д. Вишневецьким на о. Малій Хортиці першої Січі\n" +
                "1569 р.#Люблінська унія. Утворення Речі Посполитої\n" +
                "1596 р.#Берестейська церковна унія. Утворення греко-католицької церкви.\n" +
                "1621 р.#Хотинська війна\n" +
                "1632 р.#утворення Києво-Могилянського колегіуму\n" +
                "1637-1638 рр.#повстання під проводом Павла Павлюка, Якова Острянина, Дмитра Гуні\n" +
                "1648 р.#Жовтоводська, Корсунська, Пилявецька битва\n" +
                "1649 р.#Зборівська битва. Укладення Зборівського договору\n" +
                "1651 р.#Берестецька битва. Укладення Білоцерківського договору\n" +
                "1652 р.#Батозька битва\n" +
                "1654 р.#укладання українсько-російського договору\n" +
                "1659 р.#Конотопська битва\n" +
                "1667 р.#Андрусівський договір між Річчю Посполитою та Московським царством\n" +
                "1681 р.#Бахчисарайський мирний договір\n" +
                "1686 р.#«Вічний мир» між Московським царством та Річчю Посполитою.\n" +
                "1708-1709 рр.#національно-визвольна акція гетьмана І. Мазепи\n" +
                "1709 р.#Полтавська битва\n" +
                "1710 р.#ухвалення Конституції Пилипа Орлика\n" +
                "1734 р.#заснування Нової (Підпільненської) Січі.\n" +
                "1764 р.#остаточна ліквідація гетьманства\n" +
                "1768 р.#Коліївщина\n" +
                "1775 р.#остаточна ліквідація царським урядом Запорізької Січі\n" +
                "1783 р.#царський указ про закріпачення селян Лівобережної та Слобідської України\n" +
                "1798 р.#видання в Петербурзі трьох частин «Енеїди» І. Котляревського\n" +
                "грудень 1825 - січень 1826 рр.#повстання Чернігівського полку\n" +
                "1830–1831 рр.#Польське повстання\n" +
                "1846-1847 рр.#діяльність Кирило-Мефодіївського братства.\n" +
                "1816 рр.#Товариство галицьких греко-католицьких священиків\n" +
                "1833–1837 рр.#діяльність «Руської трійці»\n" +
                "1848 р.#скасування панщини в Галичині.\n" +
                "1805 р.#відкриття університету в Харкові\n" +
                "1834 р.#відкриття Київського університету імені князя Володимира.\n" +
                "1863 р.#Валуєвський циркуляр\n" +
                "1876 р.#Емський указ.\n" +
                "1868 р.#створення у Львові товариства «Просвіта»\n" +
                "1873 р.#створення у Львові Літературного товариства ім. Т. Шевченка (від 1892 р. Наукового товариства ім. Т. Шевченка)\n" +
                "1890 р.#створення РУРП.\n" +
                "1899 р.#створення УНДП.\n" +
                "1865 р.#відкриття Новоросійського університету.\n" +
                "1900 р.#утворення Революційної української партії РУП\n" +
                "серпень 1914 р.#утворення Головної української ради, створення Союзу визволення України, формування легіону Українських січових стрільців\n" +
                "березень 1917 р.#утворення Української Центральної Ради\n" +
                "квітень 1917 р.#Всеукраїнський Національний конгрес\n" +
                "червень 1917 р.#ухвалення І Універсалу УЦР\n" +
                "липень 1917 р.#ухвалення ІІ Універсалу УЦР\n" +
                "листопад 1917 р.#ухвалення ІІІ Універсалу УЦР\n" +
                "січень 1918 р.#ухвалення ІV Універсалу УЦР, проголошення незалежності УНР.\n" +
                "січень (лютий) 1918 р.#Брестський мир між УНР та державами Четверного союзу\n" +
                "29 квітня 1918 р.#державний переворот і прихід до влади П. Скоропадського\n" +
                "14 листопада 1918 р.#утворення Директорії\n" +
                "листопад 1918 р.#проголошення ЗУНР\n" +
                "22 січня 1919 р.#Акт злуки ЗУНР і УНР у єдину соборну Українську Народну Республіку\n" +
                "грудень 1919 - травень 1920 р.#Перший «Зимовий похід» Армії УНР\n" +
                "квітень 1920 р.#Варшавська угода\n" +
                "березень 1921 р.#Ризький мир\n" +
                "листопад 1921 р.#Другий «Зимовий похід» Армії УНР\n" +
                "1921-1923 рр.#голод в Україні\n" +
                "1922 р.#входження УСРР до складу СРСР\n" +
                "1923 р.#початок політики «українізації»\n" +
                "1925 р.#завершення відбудови промисловості, курс на індустріалізацію\n" +
                "1928–1938 рр.#період радянської модернізації в Україні\n" +
                "1928 р.#судовий процес у «Шахтинській справі»\n" +
                "1929 р.#судовий процес у справі «Спілки визволення України» (СВУ)\n" +
                "1929 р.#рік «великого перелому», початок суцільної колективізації\n" +
                "1932-1933 рр.#Голодомор - геноцид українського народу\n" +
                "1934 р.#перенесення столиці України з Харкова до Києва\n" +
                "1929 р.#утворення Організації українських націоналістів (ОУН)\n" +
                "1930 р.#проведення польською владою політики «пацифікації»\n" +
                "15 березня 1939 р.#проголошення незалежності Карпатської України.\n" +
                "23 серпня 1939 р.#радянсько-німецький пакт про ненапад (пакт Молотова-Ріббентропа)\n" +
                "1 вересня 1939 р.#початок Другої світової війни\n" +
                "17 вересня 1939 р.#вступ Червоної армії на територію західної України\n" +
                "листопад 1939 р.#Східну Галичину і Волинь включено до складу УРСР\n" +
                "2 серпня 1940 р.#Південну і Північну Бессарабію та Північну Буковину включено до складу УРСР\n" +
                "22 червня 1941 р.#початок Великої Вітчизняної війни\n" +
                "30 червня 1941 р.#проголошення Акта відновлення Української Держави\n" +
                "грудень 1942 р.#початок звільнення України\n" +
                "6 листопада 1943 р.#визволення Києва\n" +
                "січень - лютий 1944 р.#Корсунь-Шевченківська наступальна операція\n" +
                "вересень - жовтень 1944 рр.#Карпатсько-Ужгородська наступальна операція\n" +
                "28 жовтня 1944 р.#визволення всієї території України\n" +
                "9 травня 1945 р.#завершення Великої Вітчизняної війни, День Перемоги.\n" +
                "квітень 1945 р.#Україна стає співзасновницею ООН\n" +
                "березень 1946 р.#«саморозпуск» УГКЦ на Львівському соборі\n" +
                "1946–1947 рр.#голод в Україні\n" +
                "квітень-липень 1947 р.#операція «Вісла»\n" +
                "лютий 1954 р.#входження Кримської області до складу УРСР\n" +
                "1956 р.#ХХ з’їзд КПРС\n" +
                "1959 р.#утворення Української робітничо-селянської спілки.\n" +
                "1965 р.#реформи в сільському господарстві та промисловості («косигінська реформа»)\n" +
                "1972 р.#зміна політичного керівництва УРСР (В. Щербицький)\n" +
                "1976 р.#утворення Української Гельсінської групи\n" +
                "квітень 1985 р.#початок «перебудови»\n" +
                "26 квітня 1986 р.#вибух на Чорнобильській АЕС\n" +
                "вересень 1989 р.#створення Народного руху України за перебудову\n" +
                "березень 1990 р.#перші альтернативні вибори до Верховної Ради УРСР\n" +
                "16 липня 1990 р.#прийняття Верховною Радою Декларації про державний суверенітет України\n" +
                "24 серпня 1991 р.#прийняття Верховною Радою Акта проголошення незалежності України\n" +
                "1 грудня 1991 р.#всеукраїнський референдум і вибори Президента України.\n" +
                "6 грудня 1991 р.#заснування Збройних Сил України\n" +
                "липень 1994 р.#обрання Л. Кучми Президентом України\n" +
                "1995 р.#Україна стає членом Ради Європи\n" +
                "28 червня 1996 р.#ухвалення Конституції України\n" +
                "жовтень-грудень 2004 р.#«Помаранчева революція«, обрання Президентом України В.Ющенка\n" +
                "2008 р.#вступ України до Світової організації торгівлі (COT).\n" +
                "листопад 2013 - лютий 2014 рр.#«революція Гідності», повалення режиму В.Януковича\n" +
                "2014 р.#підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС).\n" +
                "червень 2014#обрання Президентом України П. Порошенка.\n" +
                "2014#Підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС)\n" +
                "Вересень 2014, лютий 2015#Мінські угоди (про врегулюванню конфлікту на Донбасі)");
        parseString(db,"D10", "IV- сер. III тис. до н.е.#розселення племен трипільської культури (орнаментована кераміка)\n" +
                "VIII-VI ст. до н.е.#Велика грецька колонізація\n" +
                "друга пол. V-VII ст.#Велике розселення слов'ян\n" +
                "860#Похід Аскольда на Константинополь, перший відомий договір Русі з Візантією\n" +
                "882#Об'єднання північних і південних руських земель Олегом.\n" +
                "907, 911, 941, 944#Походи князів на Константинополь (Олег та Ігор)\n" +
                "988#Запровадження християнства як державної релігії (Володимир)\n" +
                "1019-1054#Князювання Ярослава Мудрого в Києві (Руська правда, печеніги, Соф. Собор, Іларіон)\n" +
                "1036#Розгром печенігів князем Ярославом Мудрим (тут побудовано Софійський Собор)\n" +
                "1056-1057#Створення Остромирового Євангелія\n" +
                "1097#Любецький з'їзд (снем) князів («Кожен хай держить вотчину свою»)\n" +
                "1113#Початок правління Володимира Мономаха в Києві. Укладення «Повісті минулих літ».\n" +
                "1187#Перша згадка назви «Україна» в писемних джерелах. Створення «Слова о полку Ігоревім» (про похід на половців)\n" +
                "1199#Утворення Галицько-Волинської держави (Роман Мстиславович)\n" +
                "1223#Битва на р. Калка (трагічна поразка руських князів від монголо-татар)\n" +
                "1238-1264#Правління Данили Романовича Галицького (король, Львів, антимонгольська коаліція)\n" +
                "1240#Захоплення Києва монголами (Батиєм, Ордою)\n" +
                "1362#Битва на р. Сині Води (литовець Ольгерд розбив Орду та приєднав до ВКЛ укр. землі)\n" +
                "1385#Кревська унія (Ягайло і Ядвига – Литва та Польща)\n" +
                "40-і рр. XV ст.#Утворення Кримського ханства (Хаджі І Гірей)\n" +
                "1478#Визнання Кримським ханством васальної залежності від Османської імперії\n" +
                "1489#Перша згадка про українських козаків у писемних джерелах\n" +
                "1514#Битва під Оршею (православний князь К. Острозький (ВКЛ) розбив москов. війська)\n" +
                "1556-1561#Створення Пересопницького Євангелія\n" +
                "1556#Заснування князем Д. Вишневецьким першої Запорозької Січі на о. Мала Хортиця\n" +
                "1569#Люблінська унія – Утворення Речі Посполитої\n" +
                "1596#Берестейська церковна унія. Утворення Греко-католицької церкви\n" +
                "1618#Похід козаків під проводом гетьмана П. Конашевича-Сагайдачного на Москву\n" +
                "1620#Відновлення православної церковної ієрархії (І. Борецький)\n" +
                "1621#Хотинська битва (поляки з козаками перемагають турків, поранення П. Сагайдачного)\n" +
                "1625#Куруківська угода (повстання М. Жмайла; реєстр – 6 тис., поділ його земель на полки)\n" +
                "1632#«Пункти для заспокоєння руського народу». Утворення Києво-Могилянської колегії.\n" +
                "1637-38#Повстання під проводом П. Павлюка (Бута), Я. Острянина та Д. Гуні. Поляки видають «Ординацію Війська Запорозького» (1638).\n" +
                "1648-1657#Національна-визвольна війна під проводом Б. Хмельницького\n" +
                "1648#Жовтоводська, Корсунська та Пилявецька битва\n" +
                "1649#Зборівська битва та Зборівський договір («добрий» - 40 тис, 3 воєводства)\n" +
                "1651#Берестецька битва. Укладення Білоцерковського договору («поганий» - 20 тис, 1 воєв.)\n" +
                "1652#Батозька битва (продовження походу козаків Т. Хмельниц. на Молдавію)\n" +
                "1653#Жванецька облога (король Ян Казимир ледь врятувався, повернення до Збор. договору)\n" +
                "1654#Українсько-московський договір: Переяславська рада, «Березневі статті»\n" +
                "1656#Московсько-польське Віленське перемир’я (як наслідок – союз БХ зі Швец. і Транс.)\n" +
                "1658#Гадяцький договір (Виговський з Польщею про Велике князівство Руське)\n" +
                "1659#Конотопська битва (козаки з татарами розбили московську кінноту)\n" +
                "1667#Андрусівський договір (поділ України між Польщею і Москвою)\n" +
                "1669#Корсунська угода, визнання Правобережною Гетьманщиною протекторату Османської імперії (П. Дорошенко)\n" +
                "1681#Бахчисарайський мир (між Росією, Кримським ханством і Османською імперією)\n" +
                "1686#«Вічний мир» (фіксування поділу України по Дніпру між Польщею і Моск. Царством)\n" +
                "1708#Українсько-шведський союз (Мазепа). Зруйнування Батурина російськ. військами.\n" +
                "1709#Зруйнування російськими військами Чортомлицької Січі. Полтавська битва (Петро І)\n" +
                "1710#Конституція Пилипа Орлика (м. Бендери)\n" +
                "1713#Ліквідація козацтва на Правобережній Україні (польська частина України)\n" +
                "1734#Заснування Нової (Підпільненської) Січі (домігся Д. Апостол, який того ж року помер)\n" +
                "1764#Остаточна ліквідація гетьманства в Україні (Катерина ІІ зняла К. Розумовського)\n" +
                "1768#Коліївщина (гайдамаки на Правобережжі проти поляків)\n" +
                "1775#Остаточна ліквідація Запорозької Січі царським урядом (Катерина ІІ)\n" +
                "1780-1782#Ліквідація особистої залежності селян в Австрійській імперії (Марія Терезія)\n" +
                "1783#Закріпачення селян Лівобережної і Слобідської України (Катерина ІІ)\n" +
                "1798#Видання «Енеїди» І. Котляревського\n" +
                "1805#Відкриття університету в Харкові\n" +
                "1816#Створення освітнього товариства греко-католицьких священиків (Перемишль, Австрія)\n" +
                "груд 1825-січ 1826#Повстання Чернігівського полку (декабристи)\n" +
                "1828#Ліквідація Задунайської Січі (отаман Й. Гладкий)\n" +
                "1830-1831#Польське визвольне повстання (проти Росії)\n" +
                "1833-1837#Діяльність Руської трійці (Львів, «Русалка Дністрова»)\n" +
                "1834#Відкриття університету в Києві\n" +
                "1839#Ліквідація греко-католицької церкви в підросійській Україні\n" +
                "1840#Видання «Кобзаря» Т. Шевченка\n" +
                "1846-1847#Діяльність Кирило-Мефодіївського братства (Костомаров, Куліш, за федерацію слов’ян)\n" +
                "1848#Скасування панщини в Галичині; перша українськомовна газета «Зоря Галицька» («Весна народів» - революція в Австрії; Головна Руська Рада, Собор рус. учених у Львові і т.д.)\n" +
                "19.02.1861#Царський маніфест про скасування кріпосного права в Російській імперії (Олександр ІІ)\n" +
                "1863#Валуєвський циркуляр\n" +
                "1863-1864#Польське національно-визвольне повстання\n" +
                "1865#Відкриття Новоросійського університету (Одеса)\n" +
                "1868#Створення у Львові товариства «Просвіта»\n" +
                "1873#Створення у Львові Літературного товариства ім. Т. Шевченка (із 1892 – Наукове Товариство ім. Т. Шевченка)\n" +
                "1875#Відкриття Чернівецького університету\n" +
                "1876#Емський указ\n" +
                "1890#Створення Русько-української радикальної партії  (І. Франко)\n" +
                "1899#Створення Української націонал-демократичної партії (Франко, Грушевський), Української соціал-демократичної партії\n" +
                "1900#Утворення Революційної української партії (РУП) – першої в Наддніпрянській Україні\n" +
                "1900#Обрання А. Шептицького митрополитом греко-католицької церкви\n" +
                "1905-07#Революція в Росії. Жовтень 05 – маніфест Миколи ІІ. (1906 Початок реформ Столипіна)\n" +
                "1907#Впровадження в Австро-Угорській імперії загального виборчого права для чоловіків\n" +
                "1908#Створення Товариства українських поступовців (Київ, Грушевський, Чикаленко, Єфремов)\n" +
                "1911-1913#«Справа Бейліса» (антисемітизм в Росії)\n" +
                "Серпень 1914#Початок Першої світової війни: формування легіону Українських січових стрільців, утворення Головної Української Ради і Союзу Визволення України (Львів).\n" +
                "1915#Утворення Загальної Української Ради (Львів, ГУР+СВУ)\n" +
                "1916#Брусиловський прорив (наступ російської армії на захід – до Львова не дійшли)\n" +
                "Лютий-березень 1917#Лютнева революція в Росії. Повалення царського режиму\n" +
                "Березень 1917#Утворення Української Центральної Ради\n" +
                "Квітень 1917#Всеукраїнський національний конгрес у Києві\n" +
                "Червень 1917#І Універсал Центральної Ради (проголошення автономії України)\n" +
                "Липень 1917#ІІ Універсал Центральної Ради (відкладення автономії)\n" +
                "Листопад 1917#«Жовтневий» переворот в Петрограді – більшовики (Ленін) повалили Тимчасовий уряд\n" +
                "Листопад 1917#ІІІ Універсал Центральної Ради (проголошення автономії Укр. Нар. Респ. – УНР)\n" +
                "9(22) січня 1918# IV Універсал Центральної Ради (проголошення незалежності УНР)\n" +
                "Січень 1918#Бій під Крутами (загибель українських юнаків в бою проти Червоної армії)\n" +
                "Січень (лютий) 1918#Брестський мир між УНР і державами Четверного союзу\n" +
                "29 квітня 1918#Державний переворот і прихід до влади гетьмана П. Скоропадського\n" +
                "Листопад 1918#Заснування Української академії Наук (Київ)\n" +
                "1 листопада 1918#«Листопадовий зрив у Львові» (захоплення влади у місті українцями)\n" +
                "13 листопада 1918#Проголошення Західноукраїнської народної республіки (ЗУНР, Петрушевич)\n" +
                "14 листопада 1918#Утворення Директорії УНР (Винниченко, Петлюра та ін.)\n" +
                "22 січня 1919#Акт злуки УНР і ЗУНР\n" +
                "грудень 1918 - 1921#Друга українсько-радянська війна (за участі білих, отаманів, Антанти, поляків)\n" +
                "30 серпня 1919#«Київська катастрофа» (червоні відступають, але Укр. Галиц. Армія здає місто білим)\n" +
                "Груд. 1919 – трав 1920#Перший «Зимовий похід» Армії УНР\n" +
                "Квітень 1920#Варшавська угода (УНР і Польща; потім – радянсько-польська війна)\n" +
                "Листопад 1920#Розгром білих Врангеля в Криму (червоні та махновці)\n" +
                "1920#Підписання Бессарабського протоколу: визнання країнами Антанти входження Бессарабії до складу Румунії.\n" +
                "Березень 1921#Ризький мирний договір (Польща, УСРР, РСФРР: Визнання Зах. України за Польщею)\n" +
                "Листопад 1921#Другий «Зимовий похід» Армії УНР\n" +
                "1921-1923#Голод в Україні\n" +
                "1921#Перехід до нової економічної політики (непу; від продрозкладки до продподатку та ін.)\n" +
                "1921#Утворення Української Автокефальної православної церкви (УАПЦ)\n" +
                "1922#Входження УСРР до складу СРСР\n" +
                "1923#Початок політики «коренізації» в УСРР (в тому числі, «українізації»)\n" +
                "1923#Визнання країнами Антанти входження Східної Галичини до складу Польщі; саморозпуск уряду ЗУНР\n" +
                "1925#Проголошення курсу на індустріалізацію\n" +
                "1925#Утворення Українського національно-демократичного об’єднання (УНДО, Львів)\n" +
                "1928/1929 - 1932#Перша п’ятирічка\n" +
                "1928#Судовий процес у «Шахтинській справі» (проти т.зв. «шкідників»)\n" +
                "1929#«Рік великого перелому» (рішення про форсовану індустріалізацію, суцільну колективізацію)\n" +
                "1929#Початок насильницької колективізації в СРСР\n" +
                "1929#Утворення Організації українських націоналістів (ОУН, Відень, Є. Коновалець)\n" +
                "1930#Проведення польською владою акції «пацифікації»\n" +
                "1930#Судовий процес у справі «Спілки визволення України» (СВУ, засуд. С. Єфремова та ін.)\n" +
                "1932-1933#Голодомор в Україні\n" +
                "1934#Перенесення столиці УСРР з Харкова до Києва\n" +
                "1937#Ухвалення Конституції УРСР\n" +
                "1938#Надання автономії Підкарпатській Русі (Закарпаттю) у складі Чехо-Словаччини\n" +
                "1937-1938#«Великий терор» в СРСР (сталінські репресії)\n" +
                "15 березня 1939#Проголошення незалежності Карпатської України (А. Волошин)\n" +
                "23 серпня 1939#Радянсько-німецький договір про ненапад і таємний протокол до нього («пакт Молотова-Ріббентропа»)\n" +
                "1 вересня 1939#Початок Другої світової війни\n" +
                "17 вересня 1939#Вторгнення Червоної армії на територію Західної України\n" +
                "Червень 1940#Вторгнення Червоної армії на територію Бессарабії та Північної Буковини\n" +
                "22 червня 1941#Напад Німеччини на СРСР\n" +
                "30 червня 1941#Проголошення Акта відновлення незалежності Української Держави (Львів)\n" +
                "14 жовтня 1942#Створення Української повстанської армії (УПА)\n" +
                "Грудень 1942#Початок вигнання нацистських загарбників з України\n" +
                "6 листопада 1943#Визволення Києва від нацистських окупантів\n" +
                "Січень-лютий 1944#Корсунь-Шевченківська наступальна операція Радянської Армії\n" +
                "28 жовтня 1944#Завершення вигнання нацистських окупантів з території України (Карп-Ужгород. оп.)\n" +
                "9 травня 1945#День Перемоги над нацистською Німеччиною\n" +
                "2 вересня 1945#Завершення Другої світової війни (в Японії)\n" +
                "1945#Входження Закарпаття до складу УРСР\n" +
                "Квітень 1945#Україна стає співзасновницею ООН\n" +
                "Березень 1946#«Саморозпуск» Української греко-католицької церкви (УГКЦ)\n" +
                "1946-1947#Голод в Україні\n" +
                "Квітень-липень 1947#Проведення польською владою операції «Вісла» (депортація українців на захід Польщі)\n" +
                "1953-1954#Повстання політичних в’язнів в сталінських концтаборах. Ліквідація ГУЛАГу.\n" +
                "Лютий 1954#Входження Кримської області до складу УРСР\n" +
                "1956#ХХ з’їзд КПРС – засудження культу особи.\n" +
                "1957#Запуск першого штучного супутника Землі, початок «космічної ери»\n" +
                "1959#Утворення Української робітничо-селянської спілки (дисидент Л. Лук’яненко, Львів)\n" +
                "1961#Перший політ людини в Космос (Ю. Гагарін)\n" +
                "1965#Реформи в сільському господарстві та промисловості («косигінська реформа»). Перша хвиля арештів дисидентів. Виступ дисидентів в кінотеатрі «Україна».\n" +
                "1972#Зміна політичного керівництва УРСР (Шелеста на Щербицького), масові арешти дисидентів\n" +
                "1976#Утворення Української Гельсінської групи (Руденко, Григоренко, Лук’яненко та ін.)\n" +
                "Квітень 1985#Початок «перебудови»\n" +
                "26 квітня 1986#Аварія на Чорнобильській АЕС\n" +
                "Вересень 1989#Створення Народного руху України за перебудову\n" +
                "Березень 1990#Проведення перших альтернативних виборів до Верховної Ради УРСР\n" +
                "16 липня 1990#Ухвалення Верховною Радою УРСР Декларації про державний суверенітет України\n" +
                "Жовтень 1990#«Революція на граніті» (голодування студентів в Києві з політичними вимогами)\n" +
                "24 серпня 1991#Ухвалення Верховною Радою УРСР Акта проголошення незалежності України\n" +
                "1 грудня 1991#Проведення Всеукраїнського референдуму та виборів Президента України. Обрання Л. Кравчука.\n" +
                "6 грудня 1991#Заснування Збройних сил України\n" +
                "Липень 1994#Обрання Л. Кучми Президентом України\n" +
                "1995#Обрання України членом Ради Європи (РЄ)\n" +
                "28 червня 1996#Ухвалення Конституції України\n" +
                "Вересень 1996#Запровадження національної грошової одиниці – гривні\n" +
                "Жовтень-грудень 2004#«Помаранчева революція». Президентом України обрано В. Ющенка\n" +
                "2008#Вступ України до Світової організації торгівлі (СОТ)\n" +
                "2010#Обрання Президентом України В. Януковича\n" +
                "Листопад 2013 – лютий 2014#«Революція Гідності», повалення режиму В. Януковича\n" +
                "Червень 2014#Обрання Президентом П. Порошенка\n" +
                "2014#Підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС)\n" +
                "Вересень 2014, лютий 2015#Мінські угоди (про врегулюванню конфлікту на Донбасі)");
    }
}
